# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Usuario\Downloads\Practica_6\Practica_6.cydsn\Practica_6.cyprj
# Date: Tue, 20 Jul 2021 03:29:58 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2001 4001} -nominal_period 83333.333333333328 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 240001 480001} [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ZERO__/q}]

# Component constraints for C:\Users\Usuario\Downloads\Practica_6\Practica_6.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Usuario\Downloads\Practica_6\Practica_6.cydsn\Practica_6.cyprj
# Date: Tue, 20 Jul 2021 03:29:25 GMT
